โอเค สำเร็จแล้ว
ต่อไปอยากให้ใส่เลือกปี พ.ศ. แล้วแสดงผลตามปี พ.ศ.ที่เลือก หากปีไหนไม่มีข้อมูล ให้แสดงผล - ไว้
เมื่อค้นหาหมายเลขแล้ว ข้อมูลที่ขึ้นมาเป็นข้อมูลทั่วไปก่อน เช่น BMI(น้ำหนัก ส่วนสูง รอบเอว BMI แปลผล) และความดันโลหิต (ค่าความดัน ค่าชีพจร)
มีสูตรคำนวณใน gg sheet ดังนี้

สูตรBMI
=Z475/((AA475*AA475)/10000)

สูตร แปลผล
=IF((BA472=0),"",IF(BA472>30,"อ้วนมาก",IF(AND(BA472<=30,BA472>=25),"อ้วน",IF(AND(BA472<25,BA472>=23),"น้ำหนักเกิน",IF(AND(BA472<23,BA472>=18.5),"ปกติ","ผอม")))))

ผลความดันโลหิต
=IF(OR(AC472=0,AD472=0),"",IF(OR(AC472>=160,AD472>=100),"ความดันโลหิตสูง",IF(AND(AC472<120,AD472<80),"ความดันโลหิตปกติ",IF(OR(AC472>=140,AD472>=90),"ความดันโลหิตสูงเล็กน้อย","ความดันโลหิตปกติค่อนข้างสูงเล็กน้อย"))))

ประเมินรอบเอว
=IF(AB472=0,"",IF(AB472>BE472,"เกินเกณฑ์","ปกติ"))

ขอโค้ดฉบับเต็มที่ไม่เปลี่ยนโค้ดส่วนค้นหา เพราะตรงนั้นเพอร์เฟคแล้ว
